
admin_ids = [999678965, 204239586, 589380091]

output_api_settings = {
    'telegram_bot_token_for_req': 'dceKE8aq',
    'api_hostname': 'https://apidev.jobitt.com',
}


buttons_names = {
    'settings_button_name': '🛠 Настройки',
    'skills_update': '💎 Добавить подписку',
    'skills_add': '➕ Добавить подписку',
    'want_to_receive_text_messages': 'Сообщения: ✔',
    'want_to_receive_other_messages': 'Уведомления: ✔',
    'stop_receiving_text_messages': 'Сообщения: ❌',
    'stop_receiving_other_messages': 'Уведомления: ❌',
    'go_back_button': '🏠 На главную',
    'send_skills_button_name': 'Отправить',
    'mark_all_skills_button_name': 'Инвертировать',
    'new_candidate_message_button_name': 'Предложить работу',
    'send_message_to_vacancy_button_name': '✏ Написать',
    'open_contacts_to_vacancy_button_name': '☎️ Открыть контакты',
    'stats_button_name': '🧮 Статистика',
    'get_list_of_subscription': "📄 Мои подписки"
}

bot_messages = {
    'start_message_text': 'Добро пожаловать \n вы успешно авторизованы в боте',
    'token_expired_error': 'Вы не были авторизованы в боте, похоже токен просрочен, возьмите новый на сайте',
    'no_code_error': 'Не вижу код авторизации, пожалуйста переходите в бота по ссылке',
    'settings_message_text': 'Вы попали в настройки, этот текст можно изменить в конфиге на нужный',
    'go_to_main_page_text': 'Вы перешли на главную страницу, этот текст можно изменить в конфиге на нужный',
    'settings_changed': 'Настройки успешно изменены, сообщение можно поменять в конфиге',
    'skills_update_menu_text': 'Пожалуйста выберите ваши навыки, и нажмите отправить что бы обновить их список',
    'skills_update_success': 'Список скилов успешно обновлен для сайта!',
    'skills_update_fail': 'Произошла ошибка во время добавления скилов на сайт',
    'ask_to_send_text_message': 'Пожалуйста пришлите ответ:',
    'you_are_already_logged_in': 'Вы уже вошли в профиль',
}
